src/InformationRegisters/СД_ПараметрыЗаявок/СД_ПараметрыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="16514a81-a9f2-4b58-a555-5f1b831bc014">
  <name>СД_ПараметрыЗаявок</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="cd8ff465-433f-4be0-8240-0612861308f3">
    <name>ЗначениеПараметра</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Characteristic.СД_ПараметрыЗаявок</types>
    </type>
  </resources>
  <dimensions extendedConfigurationObject="b1996d7d-951d-4cb6-bc78-d0747c2c6125">
    <name>Заявка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_Заявка</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="0d2e0fe2-e9e3-4237-9a9d-7e7bcb4443f0">
    <name>ПараметрЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ChartOfCharacteristicTypesRef.СД_ПараметрыЗаявок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/СД_ОбщееВызовСервера/Module.bsl
&Вместо("ПолучитьЗаявкуПоТикету")
Функция ЧСД_ПолучитьЗаявкуПоТикету(ТикетПисьма)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	СД_ПараметрыЗаявокСрезПоследних.Заявка
	                    |ИЗ
	                    |	РегистрСведений.СД_ПараметрыЗаявок.СрезПоследних(
	                    //|			&ДатаЗаписи,
	                    |				,ПараметрЗаявки = &ПараметрЗаявки
	                    |				И ЗначениеПараметра = &ЗначениеПараметра) КАК СД_ПараметрыЗаявокСрезПоследних");
						
	//Запрос.УстановитьПараметр("ДатаЗаписи", ТекущаяДата());						
	Запрос.УстановитьПараметр("ПараметрЗаявки", ПланыВидовХарактеристик.СД_ПараметрыЗаявок.ТикетЗаявки);
	Запрос.УстановитьПараметр("ЗначениеПараметра", ТикетПисьма);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Заявка;
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
